In [460]:
import pandas as pd
import numpy as np
df=pd.read_csv('train.csv')

In [461]:
x=df.drop('Death_Count',axis=1)
y=df['Death_Count']

In [462]:
date=df['Date']

In [463]:
date.head()

0    12-07-2017
1    30-01-2019
2    24-06-2018
3    19-06-2018
4    19-11-2018
Name: Date, dtype: object

In [464]:
Date=[]
Month=[]
Year=[]
for line in date:
  line=line.split('-')
  day=line[0].strip()
  month=line[1].strip()
  year=line[2].strip()
  Date.append(int(day))
  Month.append(int(month))
  Year.append(int(year))

In [465]:
x['date']=Date

In [466]:
x['month']=Month

In [467]:
x['year']=Year

In [468]:
x=x.drop('Date',axis=1)

In [469]:
x.head()

      Galaxy  Planet_ID      Country    Disaster  date  month  year
0  Milky Way       62.0  New Zealand   Landslide    12      7  2017
1  Milky Way        8.0     Mongolia  Earthquake    30      1  2019
2  Milky Way      249.0  North Korea     Volcano    24      6  2018
3  Milky Way       74.0  North Korea     Volcano    19      6  2018
4  Milky Way      270.0           UK  Earthquake    19     11  2018

In [470]:
x['Disaster']

0         Landslide
1        Earthquake
2           Volcano
3           Volcano
4        Earthquake
            ...
64316    Earthquake
64317       Volcano
64318           NaN
64319     Landslide
64320         Flood
Name: Disaster, Length: 64321, dtype: object

In [471]:
x=x.drop('Planet_ID',axis=1)
x.head()

      Galaxy      Country    Disaster  date  month  year
0  Milky Way  New Zealand   Landslide    12      7  2017
1  Milky Way     Mongolia  Earthquake    30      1  2019
2  Milky Way  North Korea     Volcano    24      6  2018
3  Milky Way  North Korea     Volcano    19      6  2018
4  Milky Way           UK  Earthquake    19     11  2018

In [472]:
type_of_disaster=[]
for i in x['Disaster']:
  if i not in type_of_disaster:
    type_of_disaster.append(i)

In [473]:
type_of_disaster

['Landslide', 'Earthquake', 'Volcano', 'Flood', nan, 'BushFIre']

In [474]:
index_of_disaster=[]
for i in x['Disaster']:
  z=type_of_disaster.index(i)
  index_of_disaster.append(z)

In [475]:
x=x.drop('Disaster',axis=1)

In [476]:
x['Disaster']=index_of_disaster

In [477]:
x.head()

      Galaxy      Country  date  month  year  Disaster
0  Milky Way  New Zealand    12      7  2017         0
1  Milky Way     Mongolia    30      1  2019         1
2  Milky Way  North Korea    24      6  2018         2
3  Milky Way  North Korea    19      6  2018         2
4  Milky Way           UK    19     11  2018         1

In [478]:
country=[]
for i in x['Country']:
  if i not in country:
    country.append(i)

In [479]:
country

['New Zealand',
 'Mongolia',
 'North Korea',
 'UK',
 'Japan',
 'Pakistan',
 'Spain',
 'Singapore',
 'India',
 'China',
 'Russia',
 'Germany',
 'Bangladesh',
 'South Korea',
 'Australia',
 'Malaysia',
 'France',
 'Indonesia',
 'USA',
 'Canada']

In [480]:
index_of_country=[]
for i in x['Country']:
  z=country.index(i)
  index_of_country.append(z)

In [481]:
x=x.drop('Country',axis=1)

In [482]:
x['Country']=index_of_country

In [483]:
x.head()

      Galaxy  date  month  year  Disaster  Country
0  Milky Way    12      7  2017         0        0
1  Milky Way    30      1  2019         1        1
2  Milky Way    24      6  2018         2        2
3  Milky Way    19      6  2018         2        2
4  Milky Way    19     11  2018         1        3

In [484]:
galaxy=x['  Galaxy']

In [485]:
galaxy_index=list((galaxy=='Milky Way').astype(np.int))

In [486]:
x=x.drop('  Galaxy',axis=1)

In [487]:
x['Galaxy']=galaxy_index

In [488]:
x.head()

   date  month  year  Disaster  Country  Galaxy
0    12      7  2017         0        0       1
1    30      1  2019         1        1       1
2    24      6  2018         2        2       1
3    19      6  2018         2        2       1
4    19     11  2018         1        3       1

In [489]:
from keras.models import Sequential
from keras.layers import *

In [490]:
from sklearn.preprocessing import MinMaxScaler

In [491]:
x_train=x
y_train=y

In [492]:
df1=pd.read_csv('test.csv')

In [493]:
df1=df1.drop('Death_Count',axis=1)

In [494]:
date1=df1['Date']

In [495]:
Date=[]
Month=[]
Year=[]
for line in date1:
  line=line.split('-')
  day=line[0].strip()
  month=line[1].strip()
  year=line[2].strip()
  Date.append(int(day))
  Month.append(int(month))
  Year.append(int(year))

In [496]:
x1=df1

In [497]:
x1['date']=Date

In [498]:
x1['month']=Month

In [499]:
x1['year']=Year

In [500]:
x1=x1.drop('Date',axis=1)

In [501]:
x1.head()

      Galaxy  Planet_ID     Country Disaster  date  month  year
0   Sombrero        NaN  Bangladesh      NaN    14      6  2017
1  Milky Way      267.0      France    Flood    23      3  2019
2  Milky Way      267.0      France    Flood     1     12  2018
3  Milky Way      267.0      France    Flood     7      6  2017
4  Milky Way       43.0       Spain    Flood     3     10  2017

In [502]:
x1=x1.drop('Planet_ID',axis=1)
x1.head()

      Galaxy     Country Disaster  date  month  year
0   Sombrero  Bangladesh      NaN    14      6  2017
1  Milky Way      France    Flood    23      3  2019
2  Milky Way      France    Flood     1     12  2018
3  Milky Way      France    Flood     7      6  2017
4  Milky Way       Spain    Flood     3     10  2017

In [503]:
type_of_disaster=[]
for i in x1['Disaster']:
  if i not in type_of_disaster:
    type_of_disaster.append(i)

In [504]:
index_of_disaster=[]
for i in x1['Disaster']:
  z=type_of_disaster.index(i)
  index_of_disaster.append(z)

In [505]:
x1=x1.drop('Disaster',axis=1)

In [506]:
x1['Disaster']=index_of_disaster

In [507]:
x1.head()

      Galaxy     Country  date  month  year  Disaster
0   Sombrero  Bangladesh    14      6  2017         0
1  Milky Way      France    23      3  2019         1
2  Milky Way      France     1     12  2018         1
3  Milky Way      France     7      6  2017         1
4  Milky Way       Spain     3     10  2017         1

In [508]:
country=[]
for i in x1['Country']:
  if i not in country:
    country.append(i)

In [509]:
index_of_country=[]
for i in x1['Country']:
  z=country.index(i)
  index_of_country.append(z)

In [510]:
x1=x1.drop('Country',axis=1)

In [511]:
x1['Country']=index_of_country

In [512]:
x1.head()

      Galaxy  date  month  year  Disaster  Country
0   Sombrero    14      6  2017         0        0
1  Milky Way    23      3  2019         1        1
2  Milky Way     1     12  2018         1        1
3  Milky Way     7      6  2017         1        1
4  Milky Way     3     10  2017         1        2

In [513]:
galaxy=x1['  Galaxy']

In [514]:
galaxy_index=list((galaxy=='Milky Way').astype(np.int))

In [515]:
x1=x1.drop('  Galaxy',axis=1)

In [516]:
x1['Galaxy']=galaxy_index

In [517]:
x_test=x1

In [518]:
print(x_train)

       date  month  year  Disaster  Country  Galaxy
0        12      7  2017         0        0       1
1        30      1  2019         1        1       1
2        24      6  2018         2        2       1
3        19      6  2018         2        2       1
4        19     11  2018         1        3       1
...     ...    ...   ...       ...      ...     ...
64316     4      1  2019         1        1       1
64317    25      6  2017         2        4       1
64318    30     12  2018         4        0       0
64319     1      6  2017         0       19       1
64320    15      8  2018         3        6       1

[64321 rows x 6 columns]

In [519]:
scaler=MinMaxScaler(feature_range=(0,1))

In [520]:
scaled_train=scaler.fit_transform(x_train)

In [521]:
scaled_test=scaler.transform(x_test)

In [522]:
type(x_train)

pandas.core.frame.DataFrame

In [523]:
scaled_train_data=pd.DataFrame(scaled_train,columns=x_train.columns.values)

In [524]:
scaled_test_data=pd.DataFrame(scaled_test,columns=x_test.columns.values)

In [525]:
trainingdata=scaled_train_data
testingdata=scaled_test_data

In [526]:
trainingdata=trainingdata.values
testingdata=testingdata.values

In [527]:
model=Sequential()

In [528]:
model.add(Dense(100,input_dim=6,activation='relu',name='layer1'))

In [529]:
model.add(Dense(100,activation='relu',name='layer2'))

In [530]:
model.add(Dense(100,activation='relu',name='layer3'))

In [531]:
model.add(Dense(1,activation='linear',name='layer4'))

In [532]:
model.compile(loss='mean_squared_error',optimizer='adam')

In [533]:
model.fit(
    trainingdata,
    y_train,
    epochs=100,
    shuffle=True,
    verbose=2,
    )

Epoch 1/100
 - 6s - loss: 458434.9213
Epoch 2/100
 - 4s - loss: 435682.9482
Epoch 3/100
 - 6s - loss: 417967.7052
Epoch 4/100
 - 6s - loss: 396233.0251
Epoch 5/100
 - 4s - loss: 376358.1217
Epoch 6/100
 - 6s - loss: 368368.2600
Epoch 7/100
 - 6s - loss: 354858.1473
Epoch 8/100
 - 4s - loss: 339603.4604
Epoch 9/100
 - 5s - loss: 308122.2487
Epoch 10/100
 - 5s - loss: 262203.4613
Epoch 11/100
 - 4s - loss: 222186.3245
Epoch 12/100
 - 5s - loss: 181685.0032
Epoch 13/100
 - 5s - loss: 162527.5189
Epoch 14/100
 - 5s - loss: 151745.0064
Epoch 15/100
 - 4s - loss: 143842.7304
Epoch 16/100
 - 6s - loss: 139453.4547
Epoch 17/100
 - 5s - loss: 136161.0198
Epoch 18/100
 - 4s - loss: 129214.3900
Epoch 19/100
 - 6s - loss: 129804.0084
Epoch 20/100
 - 6s - loss: 119282.4979
Epoch 21/100
 - 4s - loss: 125369.5384
Epoch 22/100
 - 6s - loss: 120596.7380
Epoch 23/100
 - 5s - loss: 120374.7543
Epoch 24/100
 - 4s - loss: 115561.8633
Epoch 25/100
 - 6s - loss: 113467.8173
Epoch 26/100
 - 5s - loss: 112448.9799
Epoch 27/100
 - 5s - loss: 111445.2594
Epoch 28/100
 - 5s - loss: 108867.6183
Epoch 29/100
 - 5s - loss: 106468.7628
Epoch 30/100
 - 5s - loss: 105040.9255
Epoch 31/100
 - 4s - loss: 104835.7153
Epoch 32/100
 - 5s - loss: 102828.7495
Epoch 33/100
 - 5s - loss: 99128.1246
Epoch 34/100
 - 5s - loss: 102081.7120
Epoch 35/100
 - 6s - loss: 96131.1453
Epoch 36/100
 - 5s - loss: 94032.7753
Epoch 37/100
 - 4s - loss: 95777.8068
Epoch 38/100
 - 5s - loss: 97237.7225
Epoch 39/100
 - 5s - loss: 91260.5952
Epoch 40/100
 - 4s - loss: 90437.2014
Epoch 41/100
 - 6s - loss: 89471.6813
Epoch 42/100
 - 6s - loss: 89303.9252
Epoch 43/100
 - 4s - loss: 86288.6762
Epoch 44/100
 - 5s - loss: 86063.3884
Epoch 45/100
 - 5s - loss: 87069.8587
Epoch 46/100
 - 5s - loss: 84594.6012
Epoch 47/100
 - 5s - loss: 83341.4147
Epoch 48/100
 - 5s - loss: 84922.4744
Epoch 49/100
 - 5s - loss: 82232.1612
Epoch 50/100
 - 4s - loss: 84109.6110
Epoch 51/100
 - 5s - loss: 81877.4859
Epoch 52/100
 - 5s - loss: 83721.4397
Epoch 53/100
 - 4s - loss: 81069.6865
Epoch 54/100
 - 6s - loss: 80289.1053
Epoch 55/100
 - 6s - loss: 79368.1863
Epoch 56/100
 - 4s - loss: 81833.7342
Epoch 57/100
 - 6s - loss: 78193.5229
Epoch 58/100
 - 5s - loss: 79024.6023
Epoch 59/100
 - 4s - loss: 75847.8201
Epoch 60/100
 - 5s - loss: 76667.5847
Epoch 61/100
 - 5s - loss: 77979.6000
Epoch 62/100
 - 4s - loss: 74299.0509
Epoch 63/100
 - 6s - loss: 76836.3540
Epoch 64/100
 - 6s - loss: 75212.1076
Epoch 65/100
 - 5s - loss: 75226.0902
Epoch 66/100
 - 6s - loss: 75071.2132
Epoch 67/100
 - 6s - loss: 77740.6621
Epoch 68/100
 - 4s - loss: 72975.3463
Epoch 69/100
 - 6s - loss: 71477.8550
Epoch 70/100
 - 6s - loss: 72619.3777
Epoch 71/100
 - 4s - loss: 75138.8506
Epoch 72/100
 - 6s - loss: 70860.9415
Epoch 73/100
 - 6s - loss: 74232.4693
Epoch 74/100
 - 5s - loss: 69827.7363
Epoch 75/100
 - 5s - loss: 69907.1553
Epoch 76/100
 - 6s - loss: 70409.7370
Epoch 77/100
 - 5s - loss: 73085.4618
Epoch 78/100
 - 6s - loss: 69666.8690
Epoch 79/100
 - 6s - loss: 68698.1842
Epoch 80/100
 - 4s - loss: 67211.2392
Epoch 81/100
 - 6s - loss: 69221.2633
Epoch 82/100
 - 6s - loss: 67602.1876
Epoch 83/100
 - 4s - loss: 69898.6646
Epoch 84/100
 - 6s - loss: 68505.6873
Epoch 85/100
 - 6s - loss: 66980.5927
Epoch 86/100
 - 5s - loss: 66465.5035
Epoch 87/100
 - 5s - loss: 65861.1730
Epoch 88/100
 - 6s - loss: 65935.3692
Epoch 89/100
 - 5s - loss: 67548.8496
Epoch 90/100
 - 6s - loss: 63850.2703
Epoch 91/100
 - 6s - loss: 65120.8759
Epoch 92/100
 - 4s - loss: 64292.3722
Epoch 93/100
 - 5s - loss: 64589.8920
Epoch 94/100
 - 6s - loss: 62745.8262
Epoch 95/100
 - 5s - loss: 62638.1144
Epoch 96/100
 - 5s - loss: 63755.7834
Epoch 97/100
 - 6s - loss: 62278.8620
Epoch 98/100
 - 5s - loss: 62002.9417
Epoch 99/100
 - 5s - loss: 61285.0290
Epoch 100/100
 - 6s - loss: 59436.3627

In [535]:
prediction=model.predict(testingdata)

In [536]:
prediction

array([[ 152.58034 ],
       [  52.783722],
       [  43.080376],
       ...,
       [  34.018818],
       [  35.817165],
       [1199.4489  ]], dtype=float32)